"Abstract 1: \nThe development of a high speed multi-frequency continuous scan sonar at Sonar Research &amp; Development Ltd has resulted in the acquisition of extremely accurate, high resolution bathymetric data. This rich underwater data provides new challenges and possibilities within the field of seabed visualization. This paper introduces the reader to seabed visualization by describing two example case studies which use the Seabed Visualization System developed at SRD. Both case studies, harbour wall and shipwreck visualization, are implemented using real survey data. The high resolution of the data obtained means slight changes in the seabed topography are easily distinguishable. Annual survey inspections in both case studies enable comparisons to be made between the data sets making the visualization system an important tool for management and planning.\n\n\nAbstract 2: \n3-dimensional data visualization from any input source involves the study and understanding of several steps. These steps include data acquisition, signal processing, image processing and image generation. Using a forward-looking high frequency sonar system (which focuses sound much like the eye focuses light), standard and non-standard data processing algorithms, and industry \"standard\" visualization algorithms, this project produced accurate 3-dimensional representations of several underwater objects.&lt;&lt;ETX&gt;&gt;\n\n\nAbstract 3: \nThe detailed underwater bathymetric data provided by Sonar Research and Development's high speed multi-frequency sonar transducer system provides new challenges in the development of interactive seabed visualization tools. The paper introduces a \"Whole Field Modelling\" system developed at Sonar Research and Development Ltd and The Department of Computer Science, University of Hull. This system provides the viewer with a new 3D underwater visualization environment that allows the user to pilot a virtual underwater vehicle around an accurate seabed model. We consider two example case studies that use the Whole Field Modelling system for visualizing sonar data. Both case studies, visualizing real time pipeline dredging and pipe restoration visualization, are implemented using real survey data.\n\n\nAbstract 4: \nWe present a comparative visualization of the acoustic simulation results obtained by two different approaches that were combined into a single simulation algorithm. The first method solves the wave equation on a volume grid based on finite elements. The second method, phonon tracing, is a geometric approach that we have previously developed for interactive simulation, visualization and modeling of room acoustics. Geometric approaches of this kind are more efficient than FEM in the high and medium frequency range. For low frequencies they fail to represent diffraction, which on the other hand can be simulated properly by means of FEM. When combining both methods we need to calibrate them properly and estimate in which frequency range they provide comparable results. For this purpose we use an acoustic metric called gain and display the resulting error. Furthermore we visualize interference patterns, since these depend not only on diffraction, but also exhibit phase-dependent amplification and neutralization effects\n\n\nAbstract 5: \nReconstruction of 3D scenes using data from an acoustic imaging sonar is addressed. The acoustic lens is described, and issues concerning underwater 3D scene reconstruction from the lens data are examined. Two methods for visualizing objects in an acoustic snapshot of the ocean are discussed: mathematical morphology and a synthesis of 3D digital imaging with volume rendering.&lt;&lt;ETX&gt;&gt;\n\n\nAbstract 6: \nAcoustic quality in room acoustics is measured by well defined quantities, like definition, which can be derived from simulated impulse response filters or measured values. These take into account the intensity and phase shift of multiple reflections due to a wave front emanating from a sound source. Definition (D&lt;sub&gt;50&lt;/sub&gt;) and clarity (C&lt;sub&gt;50&lt;/sub&gt;) for example correspond to the fraction of the energy received in total to the energy received in the first 50 ms at a certain listener position. Unfortunately, the impulse response measured at a single point does not provide any information about the direction of reflections, and about the reflection surfaces which contribute to this measure. For the visualization of room acoustics, however, this information is very useful since it allows to discover regions with high contribution and provides insight into the influence of all reflecting surfaces to the quality measure. We use the phonon tracing method to calculate the contribution of the reflection surfaces to the impulse response for different listener positions. This data is used to compute importance values for the geometry taking a certain acoustic metric into account. To get a visual insight into the directional aspect, we map the importance to the reflecting surfaces of the geometry. This visualization indicates which parts of the surfaces need to be changed to enhance the chosen acoustic quality measure. We apply our method to the acoustic improvement of a lecture hall by means of enhancing the overall speech comprehensibility (clarity) and evaluate the results using glyphs to visualize the clarity (C&lt;sub&gt;50&lt;/sub&gt;) values at listener positions throughout the room.\n\n\nAbstract 7: \nWe present a new particle tracing approach for the simulation of mid- and high-frequency sound. Inspired by the photorealism obtained by methods like photon mapping, we develop a similar method for the physical simulation of sound within rooms. For given source and listener positions, our method computes a finite-response filter accounting for the different reflections at various surfaces with frequency-dependent absorption coefficients. Convoluting this filter with an anechoic input signal reproduces a realistic aural impression of the simulated room. We do not consider diffraction effects due to low frequencies, since these can be better computed by finite elements. Our method allows the visualization of a wave front propagation using color-coded blobs traversing the paths of individual phonons.\n\n\n"